api-wordlist/app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks"
---
    def index
      feedbacks = Feedback.all

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
      feedback = Feedback.find_by(id: params[:id])

INSERT INTO "feedbacks" ("description", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def create
      @feedback = Feedback.new(feedback_params)

      if @feedback.save

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def set_feedback
        @feedback = Feedback.find(params[:id])